app/Controllers/DetailProperty.php

SELECT *
FROM `detail_property`
---
    public function index(): string
    {
        $model = new ModelDetailProperty();
        $modelproperty = new ModelProperty();
        return view('backendadmin/detailproperty', ["detailproperty" => $model->findAll(), "property" => $modelproperty->findAll()]);