app/Controllers/Penyewa.php

SELECT *
FROM `penyewa`
JOIN `property` ON `penyewa`.`id_property`=`property`.`id_property`
---
    public function index(): string
    {
        $model = new Modelpenyewa();
        return view('backendadmin/penyewa', ["penyewa" => $model->join("property", "penyewa.id_property=property.id_property")-> findAll()]);