app/Controllers/Profil.php

    public function index()
    {
        $model = new Profil_Model();
        return view('backendadmin/profil_view', ["profil"=> $model->findAll()]);
---
SELECT *
FROM `profil`