app/Controllers/Property.php

SELECT *
FROM `property`
---
    public function index(): string
    {
        $model = new ModelProperty();
        return view('backendadmin/property', ["property" => $model->findAll()]);

DELETE FROM `property`
WHERE `id_property` IN ('6')
---
    public function hapus()
    {
        $model = new ModelProperty();
        $idproperty = $this->request->getVar("id_property");
        $model->delete($idproperty);