app/Models/Profil_Model.php

    public function getProfil()
    {
        return $this->orderBy('tgl_dibuat', 'DESC')->findAll();
---
SELECT *
FROM `profil`
ORDER BY `tgl_dibuat` DESC